package hw8_Neshyna_cohort52_1_19Sept;

public class Task4 {
   /* Task 4 *(Опционально)
    Напишите программу, которая просит пользователя ввести слово "hello".
    Если пользователь вводит правильное слово, программа благодарит его и
    завершает работу. Если вводится неправильное слово, программа продолжает
    запрашивать ввод, пока не будет введено правильное слово.

    Дополнительно: Подсчитайте количество попыток, потребовавшихся для
    ввода правильного слова, и выведите это количество на экран.*/
}
//TODO