package hw10_Neshyna_cohort52_1_20Sep;

/*public class T4_HW10_Neshyna_C52_1 {
    /*
    Task 4* со звездочкой (Опционально)
Дано: Два отсортированных массива целых чисел. Вам нужно найти элемент,
 который будет находиться на k-й позиции в объединенном отсортированном массиве.

Массив 1 - {100, 112, 256, 349, 770}
Массив 2 - {72, 86, 113, 119, 265, 445, 892}
k = 7

Вывод : 256

Можно такой вывод:

72, 86, 100, 112, 113, 119, 256
Искомое число: 256

Объединенный отсортированный массив был бы такой (выводить, формировать его не обязательно) -

[72, 86, 100, 112, 113, 119, 256, 265, 349, 445, 770, 892]

7-й элемент (по счету) этого массива хранит значение 256.
     */
    /* public static void main(String[] args) {

        int[] array1 = {100, 112, 256, 349, 770};
        int[] array2 = {72, 86, 113, 119, 265, 445, 892};
        int k = 7;// k number location



    }
    public static int joinArray (int[] array){


    }

    public static int kElement (int[] array, int ч){

    }
}
*/
